# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definitions..::..Size Property
Definitions Class See Also
---
The number of definitions in the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Size { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
property int Size {
	int get ();
}
```

# See Also
Definitions Class
Autodesk.Revit.DB Namespace